[{"data":1,"prerenderedAt":162},["ShallowReactive",2],{"content-count":3,"board":4},31,[5,12,17,22,27,32,37,42,47,52,57,62,67,72,77,82,87,92,97,102,107,112,117,122,127,132,137,142,147,152,157],{"_path":6,"title":7,"description":8,"featured":9,"invert":10,"card_image":11},"/dir/azom","AZoM","Offering insights on long-duration energy storage technologies and their role in achieving energy efficiency and grid stability, this platform highlights cutting-edge developments like Liquid Air Energy Storage (LAES) and initiatives like the US Department of Energy's Energy Earthshot.",false,true,"azom_logo_v3.png",{"_path":13,"title":14,"description":15,"featured":9,"invert":9,"card_image":16},"/dir/aggreko","Aggreko","Providing plug-and-play battery energy storage solutions, this company delivers efficient, flexible energy storage for both commercial and industrial sectors with a focus on sustainability and innovative technology.","04_Y-Cube_Battery_Storage_Solution_Aggreko_Product_Rendering_Perspective.png",{"_path":18,"title":19,"description":20,"featured":9,"invert":9,"card_image":21},"/dir/ameresco","Ameresco","Offering innovative and secure battery energy storage systems, this company specializes in budget-neutral infrastructure upgrades and provides comprehensive energy management services for diverse sectors including federal government, healthcare, and education.","amrc-logo-156px.png",{"_path":23,"title":24,"description":25,"featured":9,"invert":9,"card_image":26},"/dir/american_energy_storage_innovations_inc","American Energy Storage Innovations, Inc.","Offering cutting-edge energy storage solutions, American Energy Storage Innovations specializes in easy-to-install, space-efficient systems like TeraStor™, which boasts minimal on-site setup and operation costs through features like self-powering and cooling capabilities.","aesi-screenshot.png",{"_path":28,"title":29,"description":30,"featured":9,"invert":9,"card_image":31},"/dir/battery_energy_storage_system","Battery energy storage system","Rapidly responsive battery energy storage systems offer unmatched grid stabilization by transitioning from standby to full power in under a second to address grid contingencies effectively.","1200px-Overhead_View_of_Tehachapi_Energy_Storage_Project%2C_Tehachapi%2C_CA.png",{"_path":33,"title":34,"description":35,"featured":9,"invert":9,"card_image":36},"/dir/briggs__stratton","Briggs & Stratton","Specializing in innovative energy storage systems, this business offers high-capacity battery solutions alongside a comprehensive range of engines and power equipment for diverse applications.","briggs_logo_large_new.png",{"_path":38,"title":39,"description":40,"featured":9,"invert":9,"card_image":41},"/dir/csi_solar","CSI Solar","Specializing in the design, manufacturing, and integration of battery energy storage systems for utility-scale applications, this company is a leading innovator in harnessing renewable energy solutions.","CS-LOGO-RED-RGB-NEW-2024-W-TAG-2.png",{"_path":43,"title":44,"description":45,"featured":9,"invert":10,"card_image":46},"/dir/ct_green_bank","CT Green Bank","Connecticut Green Bank provides unique, incentive-driven energy storage solutions funded by electric ratepayers, promoting green energy adoption across various property and community types.","X_logo_2023_white.png",{"_path":48,"title":49,"description":50,"featured":9,"invert":10,"card_image":51},"/dir/concentric","Concentric","Specializing in pioneering energy storage solutions, this business provides resilient, independent, and secure systems tailored for critical infrastructure across utility and industrial sectors.","ConcentricLogo-RGB_NoTag_white.png",{"_path":53,"title":54,"description":55,"featured":9,"invert":9,"card_image":56},"/dir/department_of_energy","Department of Energy","Pioneering advancements in long-duration energy storage, this U.S. government agency focuses on reducing grid-scale storage costs by 90% within the decade while enhancing energy security and promoting technological breakthroughs.","us-department-of-energy-logo.png",{"_path":58,"title":59,"description":60,"featured":9,"invert":10,"card_image":61},"/dir/ess_inc","ESS, Inc.","Pioneering safe and sustainable long-duration energy storage, the first commercial iron flow battery technology transforms global energy systems with up to 12 hours of storage life, zero capacity degradation, and versatile applications including renewable baseload energy.","ESS-logo-white-200px-tm.png",{"_path":63,"title":64,"description":65,"featured":9,"invert":10,"card_image":66},"/dir/enel_green_power","Enel Green Power","Providing cutting-edge energy storage solutions, this company plays a pivotal role in enhancing the reliability of renewable energy by addressing the intermittency of sources like solar and wind.","enel-enel-green-power-logo.png",{"_path":68,"title":69,"description":70,"featured":9,"invert":9,"card_image":71},"/dir/energy_storage_solutions_llc","Energy Storage Solutions, LLC","Specializing in standalone battery energy storage systems, this company leverages its extensive experience in solar development to rapidly advance over 5 Gigawatts of projects in North Carolina, South Carolina, and Virginia, offering innovative solutions that bridge renewable energy supply gaps.","ll.png",{"_path":73,"title":74,"description":75,"featured":9,"invert":9,"card_image":76},"/dir/energy_vault","Energy Vault","Revolutionizing energy storage with its innovative gravity-based technology, this company delivers unparalleled hardware and software solutions through global partnerships.","energy_vault_purple_logo.png",{"_path":78,"title":79,"description":80,"featured":9,"invert":9,"card_image":81},"/dir/fluence","Fluence","Specializing in market-leading energy storage solutions, this company offers a comprehensive ecosystem of scalable products, services, and digital applications to support the global transition to clean energy.","Fluence_banner-Technology-Main-1.png",{"_path":83,"title":84,"description":85,"featured":9,"invert":9,"card_image":86},"/dir/hero_future_energies","Hero Future Energies","Specializing in cutting-edge energy storage technologies, this company is at the forefront of integrating renewable energy solutions globally, focusing on battery innovations, cost efficiency, and environmental sustainability.","hfe-logo-top.png",{"_path":88,"title":89,"description":90,"featured":9,"invert":9,"card_image":91},"/dir/honeywell","Honeywell","Offering a highly customizable and scalable Battery Energy Storage System that is easy to manufacture, install, configure, maintain, and recycle, with specialized expertise in industrial automation across various sectors.","Honeywell-logo.png",{"_path":93,"title":94,"description":95,"featured":9,"invert":9,"card_image":96},"/dir/ibm","IBM","Offering innovative energy storage solutions—including batteries, flywheels, and pumped-hydro systems—to facilitate the integration of renewable energy into power grids, this company aids in reducing fossil fuel dependence and helps countries achieve their net-zero goals.","ibm-8bar-logo-2560x2560.png",{"_path":98,"title":99,"description":100,"featured":9,"invert":9,"card_image":101},"/dir/mitsubishi_heavy_industries","Mitsubishi Heavy Industries","Specializing in innovative energy storage solutions, this business focuses on green hydrogen technology stored in deep underground salt caverns to aid the global transition to net zero carbon emissions.","0x0.png",{"_path":103,"title":104,"description":105,"featured":9,"invert":9,"card_image":106},"/dir/owc","OWC","Expert consultants in renewable energy, specializing in innovative energy storage solutions like flow batteries and hydrogen, provide technical insight and guidance across the full scope of energy storage projects globally.","xOWC-logo.png.pagespeed.ic.Qq2OaLK9NS.png",{"_path":108,"title":109,"description":110,"featured":9,"invert":9,"card_image":111},"/dir/omazaki_group","Omazaki Group","Specializing in comprehensive energy solutions, this business offers a unique integration of renewable energy systems, advanced energy storage methods, and post-construction management, ensuring optimized energy efficiency tailored to client needs.","cropped-logo-180x87.png",{"_path":113,"title":114,"description":115,"featured":9,"invert":9,"card_image":116},"/dir/power_sonic","Power Sonic","Offering tailor-made energy storage solutions with advanced smart technologies, this business leverages over 50 years of expertise to support grid resilience and peak demand management, ensuring optimal performance in demanding applications.","powersonicfav.png",{"_path":118,"title":119,"description":120,"featured":9,"invert":9,"card_image":121},"/dir/power_storage_solutions","Power Storage Solutions","Power Storage Solutions specializes in scalable microgrid solutions using advanced battery energy storage technology, providing reliable, on-grid and off-grid capabilities, and serving numerous Fortune 1000 companies.","PWRSS-Logo-300x125.png",{"_path":123,"title":124,"description":125,"featured":9,"invert":9,"card_image":126},"/dir/rwe","RWE","Harnessing the power of battery storage, this company efficiently stores electricity during periods of low demand and market prices, ensuring a reliable energy supply when demand peaks.","OG-batteriespeicher.png",{"_path":128,"title":129,"description":130,"featured":9,"invert":9,"card_image":131},"/dir/sma_solar","SMA Solar","Offering cutting-edge battery inverters that enable efficient storage and flexible use of solar energy, this business uniquely ensures grid independence and significant energy cost savings even during night or overcast conditions.","csm_SMA-Storage-Solutions_1055x551_df94160176.png",{"_path":133,"title":134,"description":135,"featured":9,"invert":10,"card_image":136},"/dir/sandia_national_laboratories","Sandia National Laboratories","Focused on advancing energy storage technologies through collaborative research and development, this program emphasizes safety, reliability, and environmental considerations, featuring partnerships with leading national laboratories.","ess-logo.png",{"_path":138,"title":139,"description":140,"featured":9,"invert":10,"card_image":141},"/dir/siemens_energy","Siemens Energy","Offering innovative energy storage solutions to stabilize electrical grids and support the transition to renewable energy, this company plays a critical role in decarbonizing power generation and securing sustainable energy supply chains.","SE_Logo_White.png",{"_path":143,"title":144,"description":145,"featured":9,"invert":9,"card_image":146},"/dir/stem","Stem","Offering unparalleled expertise in AI-driven energy storage, this company operates the world’s largest digitally connected storage network and provides turnkey services to optimize energy savings and operations for businesses, developers, and utilities.","nasa-_SFJhRPzJHs-unsplash.png",{"_path":148,"title":149,"description":150,"featured":9,"invert":9,"card_image":151},"/dir/totalenergies","TotalEnergies","Offering a seamless, low-cost PPA transaction structure and a money-back Storage Savings Guarantee, this company specializes in integrating customer-sited solar and energy storage solutions with proprietary energy management software to optimize operations and capitalize on clean energy incentives, ensuring guaranteed savings without complex monitoring.","TE_LOGO.png",{"_path":153,"title":154,"description":155,"featured":9,"invert":9,"card_image":156},"/dir/total_energy_solutions","Total Energy Solutions","Specializing in integrating advanced battery energy storage systems into existing infrastructures, this business offers reliable, flexible, and sustainable energy solutions tailored to various sectors.","t-logo.png",{"_path":158,"title":159,"description":160,"featured":9,"invert":9,"card_image":161},"/dir/wartsila","Wärtsilä","Leveraging the advanced GEMS Digital Energy Platform and scalable GridSolv Quantum solutions, this company offers comprehensive, end-to-end energy storage optimization that integrates renewable energy and future-proofs energy assets for operators globally.","w_logo_color_pos_rgb.png",1735560591028]