{"_path":"/dir/totalenergies","_dir":"dir","_draft":false,"_partial":false,"_locale":"","title":"TotalEnergies","description":"End-to-end solutions for customer-sited solar, including energy storage. to capitalize on clean energy incentives for customers","featured":false,"invert":false,"card_image":"TE_LOGO.png","tags":["Design Build","Renewable Producer Solutions","Battery Energy Storage System"],"body":{"type":"root","children":[{"type":"element","tag":"div","props":{"align":"center"},"children":[{"type":"element","tag":"a","props":{"href":"https://solar.totalenergies.us/energy-storage/"},"children":[{"type":"element","tag":"img","props":{"src":"TE_LOGO.png","alt":"Logo","style":"min-width: 200px; max-width: 600px; height: auto;"},"children":[]}]}]},{"type":"element","tag":"h1","props":{"id":"totalenergies"},"children":[{"type":"text","value":"TotalEnergies"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://solar.totalenergies.us/energy-storage/"},"children":[{"type":"text","value":"Visit Website"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"End-to-end solutions for customer-sited solar, including energy storage. to capitalize on clean energy incentives for customers"}]}]},{"type":"element","tag":"h2","props":{"id":"overview"},"children":[{"type":"text","value":"Overview"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"TotalEnergies is a leading company in the energy storage market, renowned for its innovative solutions in navigating the complexities of sizing behind-the-meter storage and microgrid systems. The company differentiates itself through its comprehensive service offerings, technical expertise, and a commitment to delivering retail electricity tariff savings to its customers. With over 2 GWh of contracted energy storage under management, TotalEnergies is a significant player in the energy sector, offering customized services to maximize clean energy incentives and optimize energy usage for various applications."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"TotalEnergies has established a strong presence in the global energy market by focusing on customer satisfaction and guaranteed financial savings. They provide a simple, low-cost Power Purchase Agreement (PPA) structure for solar-paired or standalone storage solutions. Their proprietary energy management software automates and optimizes Energy Storage System (ESS) operations globally, ensuring efficient energy management and minimizing costs."}]},{"type":"element","tag":"h2","props":{"id":"products-services"},"children":[{"type":"text","value":"Products & Services"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"TotalEnergies offers an extensive range of products and services, primarily focusing on energy storage solutions. Their offerings include customer-sited solar installations, community solar projects, ground mounts, roof mounts, carports, and electric vehicle (EV) infrastructure. The company excels in creating integrated solutions that incorporate energy storage and solar technologies, providing clients with resilient and sustainable energy options."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In addition to traditional energy storage solutions, TotalEnergies provides proprietary energy management software that automates demand charge management and energy arbitrage. This software optimizes ESS operations in alignment with governmental incentives and ensures that all projects achieve maximum financial and energy efficiency benefits. TotalEnergies also guarantees measurable financial savings with their money-back Storage Savings Guarantee, ensuring that clients receive significant cost reductions each year, or the cost of the system is refunded."}]},{"type":"element","tag":"h2","props":{"id":"company-details"},"children":[{"type":"text","value":"Company Details"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Founded as part of the TotalEnergies Group, the company has a growing footprint in the U.S. and global energy markets, spearheading the charge in commercial energy storage and renewable energy solutions. TotalEnergies is recognized for its pioneering approach to adapting new technologies in the energy sector, consistently expanding its service portfolio to meet the changing needs of the market."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"TotalEnergies actively engages in and serves multiple markets including commercial and industrial sectors, government and public agencies, and educational institutions. They have paved the way for sustainable energy solutions, leveraging the latest advancements and legislative opportunities such as the Inflation Reduction Act to maximize client benefits. The company's innovative strategies and client-focused approach position it as an industry leader in providing energy storage solutions that meet the diverse demands of their clients across different sectors."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"overview","depth":2,"text":"Overview"},{"id":"products-services","depth":2,"text":"Products & Services"},{"id":"company-details","depth":2,"text":"Company Details"}]}},"_type":"markdown","_id":"content:dir:TotalEnergies.md","_source":"content","_file":"dir/TotalEnergies.md","_stem":"dir/TotalEnergies","_extension":"md","sitemap":{"loc":"/dir/totalenergies"}}